lib/tasks/import.rake

INSERT INTO "posts" ("id", "user_id", "title", "body", "created_at", "updated_at", "open_range", "like_count", "posted_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
	task posts: :environment do
		filename = File.join Rails.root, "posts.csv"
		file = CSV.read(filename, col_sep:',', encoding: "EUC-KR")
		cnt=0
		file.each do |row|
			user_id,post_id,title, body,created_at, updated_at,open_range, like_count, posted_at, index = row

			post = Post.new(title:title,body:body,created_at:created_at,updated_at:updated_at,open_range:open_range,like_count:like_count,posted_at:posted_at)
			#post.id=post_id
			post.save

INSERT INTO "codis" ("id", "post_id", "event", "preference", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["id", 3], ["post_id", 3], ["event", "데이트"], ["preference", 2018], ["created_at", "2018-11-30 14:24:54.023878"], ["updated_at", "2018-09-01 03:00:00"]]
---
	task codis: :environment do
		filename = File.join Rails.root, "codis.csv"
		file = CSV.read(filename, col_sep:',', encoding: "EUC-KR")
		cnt=0
		file.each do |row|
			post_id,codi_id,e,c,u,p,i=row

			codi = Codi.new(event:e,preference:p,created_at:c,updated_at:u)
			#codi.id=codi_id
			codi.save

INSERT INTO "cloths" ("id", "codi_id", "color", "main_category", "sub_category", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["id", 1], ["codi_id", 3], ["color", "검정"], ["main_category", "원피스 "], ["sub_category", "미니"], ["created_at", "2018-09-01 03:00:00"], ["updated_at", "2018-09-01 03:00:00"]]
---
	task clothes: :environment do
		filename = File.join Rails.root, "clothes.csv"
		file = CSV.read(filename, col_sep:',', encoding: "EUC-KR")
		cnt=0
		file.each do |row|
			codi_id,cloth_id,m,s,co,c,u=row

			cloth = Cloth.new(main_category:m,sub_category:s,color:co,created_at:c,updated_at:u)
			#cloth.id=cloth_id
			cloth.save