app/data_management/cloth_dm.rb

  def self.createCloth(params=nil)
    if params==nil
      return Cloth.new
    else
      cloth = Cloth.new
      cloth.codi_id = params[:codi_id]
      cloth.main_category = params[:main_category]
      cloth.sub_category = params[:sub_category]
      cloth.color = params[:color]

      cloth.save
---
INSERT INTO "cloths" ("codi_id", "color", "main_category", "sub_category", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["codi_id", 4], ["color", "Green"], ["main_category", "원피스"], ["sub_category", "미니"], ["created_at", "2018-12-11 02:42:24.273844"], ["updated_at", "2018-12-11 02:42:24.273844"]]