app/data_management/post_dm.rb

  def self.createPost(params=nil)
    if params == nil
      return Post.new
    else
      post = Post.new
      post.user_id = params[:user_id]
      post.title = params[:title]
      post.body = params[:body]
      post.image = params[:image]
      post.posted_at = params[:posted_at]
      post.save
---
INSERT INTO "posts" ("user_id", "title", "body", "created_at", "updated_at", "posted_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 1], ["title", "f"], ["body", "qq"], ["created_at", "2018-12-06 04:50:28.134586"], ["updated_at", "2018-12-06 04:50:28.134586"], ["posted_at", "2018-12-27"]]

  def self.getPost(id)
    return Post.find(id)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]