app/before_controllers/cloth_model.rb

INSERT INTO "cloths" ("codi_id", "color", "main_category", "sub_category", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["codi_id", 2], ["color", "Red"], ["main_category", "원피스"], ["sub_category", "롱"], ["created_at", "2018-11-29 06:49:08.830096"], ["updated_at", "2018-11-29 06:49:08.830096"]]
---
  def self.createCloth(params=nil)
    if params==nil
      return Cloth.new
    else
      byebug
      cloth = Cloth.new
      cloth.codi_id = params[:codi_id]
      cloth.main_category = params[:main_category]
      cloth.sub_category = params[:sub_category]
      cloth.color = params[:color]

      cloth.save