app/before_controllers/codi_model.rb

  def self.createCodi(params=nil)
    if params==nil
      return Codi.new
    else
      codi = Codi.new
      codi.post_id = params[:post_id]
      codi.weather = params[:weather] if params[:weather] != false
      codi.event = params[:event]
      codi.preference = params[:preference]
      codi.save
---
INSERT INTO "codis" ("post_id", "weather", "event", "preference", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)