app/before_controllers/post_model.rb

INSERT INTO "posts" ("user_id", "title", "body", "created_at", "updated_at", "posted_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 1], ["title", "ww"], ["body", "ww"], ["created_at", "2018-11-27 05:31:18.634964"], ["updated_at", "2018-11-27 05:31:18.634964"], ["posted_at", "2018-11-27"]]
---
  def self.createPost(params=nil)
    if params == nil
      return Post.new
    else
      post = Post.new
      post.user_id = params[:user_id]
      post.title = params[:title]
      post.body = params[:body]
      post.image = params[:image]
      post.posted_at = params[:posted_at]
      post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def self.getPost(id)
    return Post.find(id)

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 8]]
---
  def self.destroyPost(id)
    post = Post.find(id)
    post.destroy