app/before_controllers/posts_model.rb

  def self.createPost
---
INSERT INTO "posts" ("user_id", "title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["title", "sdfw"], ["body", "qqq"], ["created_at", "2018-11-22 03:34:55.183377"], ["updated_at", "2018-11-22 03:34:55.183377"]]

  def self.getPost(id)
    return Post.find(id)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def self.setPost(id, post_params)
    post = Post.find(id)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]

  def self.destroyPost(id)
    post = Post.find(id)
    post.destroy
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 1]]