app/controllers/codis_controller.rb

INSERT INTO "codis" ("post_id", "event", "preference", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["post_id", 2], ["event", "비즈니스"], ["preference", 5], ["created_at", "2018-11-27 00:45:08.337148"], ["updated_at", "2018-11-27 00:45:08.337148"]]
SELECT  "codis".* FROM "codis" ORDER BY "codis"."id" DESC LIMIT ?  [["LIMIT", 1]]
---
  def self.create(params)
    CodiModel.createCodi(params)
    return Codi.last.id