app/controllers/diary_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ? AND "posts"."posted_at" = ?  [["user_id", 1], ["posted_at", "2018-11-24"]]
---
  def index_post
    if params[:picked_date].present?
      @picked_date = params[:picked_date]
    else
      @picked_date = Date.today.strftime('%Y-%m-%d')
    end

    @my_posts = Post.index(current_user)
    @target_posts = @my_posts.where(posted_at: @picked_date)

INSERT INTO "posts" ("user_id", "title", "body", "created_at", "updated_at", "posted_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 1], ["title", "title one"], ["body", "ont"], ["created_at", "2018-11-24 09:19:49.432209"], ["updated_at", "2018-11-24 09:19:49.432209"], ["posted_at", "2018-11-24"]]
INSERT INTO "codis" ("post_id", "event", "preference", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["post_id", 2], ["event", "비즈니스"], ["preference", 5], ["created_at", "2018-11-27 00:45:08.337148"], ["updated_at", "2018-11-27 00:45:08.337148"]]
INSERT INTO "cloths" ("codi_id", "color", "main_category", "sub_category", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["codi_id", 2], ["color", "Red"], ["main_category", "원피스"], ["sub_category", "롱"], ["created_at", "2018-11-29 06:49:08.830096"], ["updated_at", "2018-11-29 06:49:08.830096"]]
---
  def create_post
    # 날씨정보 받아오기
    weather = get_current_weather

    # post params
    post_params = params[:post]
    post_id = Post.create_post(post_params)

    # codi params
    codi_params = {}
    codi_params.merge!(post_id: post_id)
    codi_params.merge!(weather: weather)
    codi_params.merge!(event: params[:event])
    codi_params.merge!(preference: params[:preference])
    codi_id = Codi.create_codi(codi_params)

    # clothes params
    clothes_info = JSON.parse(params['clothes_info'])
    clothes_info.each do |cloth_info|
      cloth_params = {}
      byebug
      cloth_params[:codi_id] = codi_id
      cloth_params[:main_category] = cloth_info['main']
      cloth_params[:sub_category] = cloth_info['sub']
      cloth_params[:color] = cloth_info['color']

      Cloth.create_cloth(cloth_params)

DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 1]]
---
  def destroy_post
    Post.destroy_post(@post)

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ? AND "posts"."posted_at" = ?  [["user_id", 1], ["posted_at", "2018-11-24"]]
---
  def pick_date
    @picked_date = params[:picked_date]
    my_posts = Post.index(current_user)
    @target_posts = my_posts.where(posted_at: @picked_date)