app/controllers/home_controller.rb

  def index
    #tab1 -> diary
    if params[:picked_date].present?
      @picked_date = params[:picked_date]
    else
      @picked_date = Date.today.strftime('%Y-%m-%d')
    end
    @my_posts = Post.index(current_user)
    @target_posts = @my_posts.where(posted_at: @picked_date)
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ? AND "posts"."posted_at" = ?  [["user_id", 1], ["posted_at", "2018-11-24"]]