app/controllers/lookbook_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 1]]
---
  def index
    @my_posts = Post.index(current_user)
    @others_posts = Post.where.not(user_id: current_user.id)