app/controllers/posts_controller.rb

INSERT INTO "posts" ("user_id", "title", "body", "created_at", "updated_at", "posted_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 1], ["title", "title one"], ["body", "ont"], ["created_at", "2018-11-24 09:19:49.432209"], ["updated_at", "2018-11-24 09:19:49.432209"], ["posted_at", "2018-11-24"]]
---
  def self.new_p
    return PostModel.createPost

INSERT INTO "posts" ("user_id", "title", "body", "created_at", "updated_at", "posted_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 1], ["title", "k"], ["body", "m"], ["created_at", "2018-11-27 00:45:03.855680"], ["updated_at", "2018-11-27 00:45:03.855680"], ["posted_at", "2018-11-24"]]
SELECT  "posts".* FROM "posts" ORDER BY "posts"."id" DESC LIMIT ?  [["LIMIT", 1]]
---
  def self.create(params)
    byebug
    post = Post.new
    post.user_id = params[:user_id]
    post.title = params[:title]
    post.body = params[:body]
    post.image = params[:image]
    post.posted_at = params[:posted_at]
    post.save

    return Post.last.id