app/controllers/search_controller.rb

SELECT "cloths".* FROM "cloths" WHERE (main_category LIKE '%dfsff%' OR sub_category LIKE '%dfsff%' OR color LIKE '%dfsff%')
SELECT "codis".* FROM "codis" WHERE (event LIKE '%dfsff%')
SELECT "posts".* FROM "posts" WHERE (title LIKE '%dfsff%' OR body LIKE '%dfsff%')
---
  def search_by(search_term)
    arr = Set.new([])
    string = "%#{search_term}%"
    post = Post.where('title LIKE ? OR body LIKE ?', string, string)

    codi = Codi.where('event LIKE ?', string)
    cloth = Cloth.where('main_category LIKE ? OR sub_category LIKE ? OR color LIKE ?', string, string, string)
    cloth.each do |cloth|
      tmp = CodiModel.returnPost(cloth.codi_id)
      arr.add(tmp)
    end
    codi.each do |codi|
      arr.add(codi.post_id)
    end
    post.each do |post|