app/controllers/search_controller.rb

  def result
    if params[:search]
      @search_term = params[:search]
    end
    @target_posts = PostModel.search_by(@search_term)
    #byebug
    @target_posts = @target_posts.where(user_id: current_user.id)
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" IN (?, ?, ?, ?, ?) AND "posts"."user_id" = ?  [["id", 1], ["id", 2], ["id", 3], ["id", 4], ["id", 5], ["user_id", 1]]