app/models/codi.rb

SELECT  "codis".* FROM "codis" ORDER BY "codis"."id" DESC LIMIT ?  [["LIMIT", 1]]
---
  def self.create_codi(params)
    CodiDm.createCodi(params)
    return Codi.last.id