app/models/post.rb

  def self.create_post(params)
    PostDm.createPost(params)
    return Post.last.id
---
SELECT  "posts".* FROM "posts" ORDER BY "posts"."id" DESC LIMIT ?  [["LIMIT", 1]]